Revit 2027 API
PreferredJunctionType Enumeration
 Enumerated type representing the possible options for the preferred junction for a routine preference rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum PreferredJunctionType
Public Enumeration PreferredJunctionType
public enum class PreferredJunctionType
type PreferredJunctionType
Members
Member name | Value | Description
Tap | 1 |  Tap junction type.
Tee | 0 |  Tee junction type.
See Also
Reference
Autodesk.Revit.DB Namespace